{
  "__data_type": "UTI ",
  "AddCost": {
    "type": "dword",
    "value": 0
  },
  "BaseItem": {
    "type": "int",
    "value": 29
  },
  "Charges": {
    "type": "byte",
    "value": 0
  },
  "Comment": {
    "type": "cexostring",
    "value": ""
  },
  "Cost": {
    "type": "dword",
    "value": 0
  },
  "Cursed": {
    "type": "byte",
    "value": 0
  },
  "DescIdentified": {
    "id": 62546,
    "type": "cexolocstring",
    "value": {
      "0": "DM Commands\n<czzþ>These are the DM commands that DMs and DMs logged in as players can use via chat. They are case insensitive.\n<c þ >Commands shown in green must either be sent via tell or targeted with the command targeter. You will be prompted to use the command targeter if you do not target via tell.\n<c þ >dm_align_chaos <cþþþ>= The target has their alignment shifted towards chaos by the number of points input. The command format is <c´þd>dm_align_chaos (amount to shift)<cþþþ>. Note that partymembers will be affected as well to an extent.\n<c þ >dm_align_evil <cþþþ>= The target has their alignment shifted towards evil by the number of points input. The command format is <c´þd>dm_align_evil (amount to shift)<cþþþ>. Note that partymembers will be affected as well to an extent.\n<c þ >dm_align_good <cþþþ>= The target has their alignment shifted towards good by the number of points input. The command format is <c´þd>dm_align_good (amount to shift)<cþþþ>. Note that partymembers will be affected as well to an extent.\n<c þ >dm_align_law <cþþþ>= The target has their alignment shifted towards law by the number of points input. The command format is <c´þd>dm_align_law (amount to shift)<cþþþ>. Note that partymembers will be affected as well to an extent.\n<c þ >dm_bandm <cþþþ>= Bans the target from using DM channel until the next reset. May not be targeted at a DM.\n<c þ >dm_banplayer_perm <cþþþ>= Bans the target player's cdkey permanently from your server. If the banned player attempts to reconnect they are autobooted. May not be targeted at a DM.\n<c þ >dm_banplayer_temp <cþþþ>= Bans the target player's cdkey from your server until the next reset. If the banned player attempts to reconnect they are autobooted. May not be targeted at a DM.\n<c þ >dm_banshout_temp <cþþþ>= Bans the target from using shout channel until the next reset. May not be targeted at a DM.\n<c þ >dm_banshout_perm <cþþþ>= Bans the target from using shout channel permanently. May not be targeted at a DM.\n<czzþ>dm_getbanlist <cþþþ>= Shows a list of all the players banned from shout or DM channel.\n<c þ >dm_getbanreason <cþþþ>= Shows why the target was banned from shout channel - Spam or DM. The reason for the banning is only stored until the next reset, so will not display for permabanned players. The name of the DM who did the ban will be shown for DM bans, and the message that resulted in the ban will be displayed for spam autobans.\n<c þ >dm_unbandm <cþþþ>= The target is no longer banned from using DM channel.\n<c þ >dm_unbanshout <cþþþ>= The target is no longer banned from using shout channel.\n<c þ >dm_fx <cþþþ>= Allows the DM to create any vfx on the target. For COM, IMP, and FNF visuals, the format is simple, because the duration type and time are always 0: <c´þd>dm_fx (vfx#) 0 0 <cþþþ>. Example: to apply a meteor swarm vfx effect on the target: <c´þd>dm_vfx 28 0 0 <cþþþ>. For DUR, BEAM, and EYES visuals, a duration type and duration must be specified, and you may also choose to make the effect extraordinary (undispellable) or supernatural (not removed by rest), or both. The format: <c´þd>dm_fx (vfx#) (duration type#) (duration) (E/S/SE) <cþþþ>. Duration type is either 1 for temporary or 2 for permanent. Duration is the number of seconds to want the effect to last. Example: to apply a dominated vfx effect to the target for a duration of 5 minutes (300 seconds): <c´þd>dm_vfx 209 1 300 <cþþþ>. To make that same effect Extraordinary: <c´þd>dm_vfx 209 1 300 E <cþþþ>. To make permanent vfx you use 2 for the type, and use 0 for the number of seconds: <c´þd>dm_vfx 209 2 0 <cþþþ>. Because vfx numbers are far from intuitive, a <c´þd>dm_fx_list_*<cþþþ> command is available to show what vfx # creates what effect.\n<czzþ>dm_fx_list_* <cþþþ>= Lists the vfx numbers and names of each type of vfx, by replacing the asterisk with one of 6 three-letter fx type codes: dur, bea, eye, imp, com, fnf. Example: <c×{þ>dm_fx_list_fnf<cþþþ> lists all the vfx names and numbers for Fire-and-Forget type visual effects. <c×{þ>dm_fx_list_dur<cþþþ> lists duration types, <c×{þ>dm_fx_list_bea<cþþþ> lists beam types, and so on.\n<c þ >dm_fx_loc <cþþþ>= This command is identical in function and format to the <c´þd>dm_fx command<cþþþ>, but will create the effect at the target location instead of on a target object.\n<c þ >dm_fx_rem <cþþþ>= Removes all visual effects on the target that were created by the sender. This includes all those created by the <c´þd>dm_fx command<cþþþ>.\n<c þ >dm_fac_a_allally <cþþþ>= All creatures in the area of the target have their faction reputation set to 100 (ally) for the enemy, merchant, commoner, and defender factions. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_a_allfoe <cþþþ>= All creatures in the area of the target have their faction reputation set to 0 (enemy) for the enemy, merchant, commoner, and defender factions. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_a_peace <cþþþ>= All creatures in the area of the target have their faction reputation set to 11 (nonhostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_a_reset <cþþþ>= All creatures in the area of the target have their faction reputation set to 0 (hostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_c_allally <cþþþ>= The target has their faction reputation set to 100 (ally) for the enemy, merchant, commoner, and defender factions.\n<c þ >dm_fac_c_allfoe <cþþþ>= The target has their faction reputation set to 0 (enemy) for the enemy, merchant, commoner, and defender factions.\n<c þ >dm_fac_c_peace <cþþþ>= The target has their faction reputation set to 11 (nonhostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction.\n<c þ >dm_fac_c_reset <cþþþ>= The target has their faction reputation set to 0 (hostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction.\n<c þ >dm_fac_m_allally <cþþþ>= All creatures in the area of the target except pcs have their faction reputation set to 100 (ally) for the enemy, merchant, commoner, and defender factions. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_m_allfoe <cþþþ>= All creatures in the area of the target except pcs have their faction reputation set to 0 (enemy) for the enemy, merchant, commoner, and defender factions. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_m_peace <cþþþ>= All creatures in the area of the target except pcs have their faction reputation set to 11 (nonhostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_m_reset <cþþþ>= All creatures in the area of the target except pcs have their faction reputation set to 0 (hostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction. May also be targeted at the area itself by clicking the ground.\n<c þ >dm_fac_p_allally <cþþþ>= All players in the party of the target have their faction reputation set to 100 (ally) for the enemy, merchant, commoner, and defender factions.\n<c þ >dm_fac_p_allfoe <cþþþ>= All players in the party of the target have their faction reputation set to 0 (enemy) for the enemy, merchant, commoner, and defender factions.\n<c þ >dm_fac_p_peace <cþþþ>= All players in the party of the target have their faction reputation set to 11 (nonhostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction.\n<c þ >dm_fac_p_reset <cþþþ>= All players in the party of the target have their faction reputation set to 0 (hostile) to the enemy faction, 50 (neutral) to the merchant faction, 91 (ally) to the commoner faction, and 100 to the defender faction.\n<c þ >dm_givexp <cþþþ>= Gives the target the specified amount of experience. The command format is <c´þd>dm_givexp (amount of xp to give)<cþþþ>. To award 500xp, for instance, you would type: <c´þd>dm_givexp 500<cþþþ>.\n<c þ >dm_givelevel <cþþþ>= Gives the target the specified number of levels. The command format is <c´þd>dm_givelevel (number of levels to give)<cþþþ>. To give 2 levels, for instance, you would type: <c´þd>dm_givelevel 2<cþþþ>.\n<c þ >dm_takexp <cþþþ>= Removes the specified amount of experience from the target. The command format is <c´þd>dm_takexp (amount of xp to take)<cþþþ>. To remove 500xp, for instance, you would type: <c´þd>dm_takexp 500<cþþþ>.\n<c þ >dm_takelevel <cþþþ>= Removes the specified number of levels from the target. The command format is <c´þd>dm_takelevel (number of levels to take)<cþþþ>. To take 2 levels, for instance, you would type: <c´þd>dm_takelevel 2<cþþþ>.\n<c þ >dm_givepartyxp <cþþþ>= All players in the party of the target receive the amount of experience specified. Command format is <c´þd>dm_givepartyxp (amount to give)<cþþþ>.\n<c þ >dm_givepartylevel <cþþþ>= All players in the party of the target receive the number of levels specified. Command format is <c´þd>dm_givepartylevel (number to give)<cþþþ>.\n<c þ >dm_takepartyxp <cþþþ>= All players in the party of the target lose the amount of experience specified. Command format is <c´þd>dm_takepartyxp (amount to remove)<cþþþ>.\n<c þ >dm_takepartylevel <cþþþ>= All players in the party of the target lose the number of levels specified. Command format is <c´þd>dm_takepartylevel (number to remove)<cþþþ>.\n<czzþ>dm_ignoredm <cþþþ>= The sender will ignore DM channel if they are logged in as a player.\n<czzþ>dm_ignoremeta <cþþþ>= The sender will ignore meta channels.\n<czzþ>dm_ignoretells <cþþþ>= The sender will ignore all tells except those sent to or by him.\n<czzþ>dm_unignoredm <cþþþ>= The sender will no longer ignore DM channel.\n<czzþ>dm_unignoremeta <cþþþ>= The sender will no longer ignore meta channels.\n<czzþ>dm_unignoretells <cþþþ>= The sender will no longer ignore any tells.\n<c þ >dm_item_id <cþþþ>= All items in the target's inventory are identified.\n<c þ >dm_item_destroy_all <cþþþ>= All the target's items are destroyed. May only be used on creatures.\n<c þ >dm_item_destroy_equip <cþþþ>= All items the target has equipped are destroyed. May only be used on creatures.\n<c þ >dm_item_destroy_inv <cþþþ>= All items in the target's inventory are destroyed.\n<czzþ>dm_invis <cþþþ>= The sender is made cutsecene invisible and ghosted.\n<czzþ>dm_uninvis <cþþþ>= The sender is no longer cutsecene invisible or ghosted.\n<c þ >dm_invuln <cþþþ>= The target is made invulnerable.\n<c þ >dm_uninvuln <cþþþ>= The target is made vulnerable again.\n<c þ >dm_learn <cþþþ>= Teaches the target the language specified. The language name, in lower case, follows the command: <c´þd>dm_learn sylvan<cþþþ>, for instance, would teach the target the Sylvan language. You can list the available languages using the <c×{þ>!list alllanguages<cþþþ> command.\n<c þ >dm_unlearn <cþþþ>= Removes knowledge of the language specified from the target. Format is the same as <c´þd><cþþþ>dm_learn: <c´þd><cþþþ>dm_unlearn sylvan . You can list the available languages using the <c×{þ>!list alllanguages<cþþþ> command.\n<czzþ>dm_listcommands <cþþþ>= The sender is sent a list of all the dm_ commands for use by DMs and DMs logged in as players.\n<c þ >dm_help <cþþþ>= Lists the useable dm_ commands useable by DMs and DMs logged in as players, plus explanations.\n<c þ >dm_boot <cþþþ>= The target is booted. May not be used on other DMs.\n<c þ >dm_change_appear <cþþþ>= Allows the DM to change the appearance of the targeted creature. The command format is <c´þd>dm_change_appear (appearance number)<cþþþ> . Example: to change the target's appearance to that of a badger: <c´þd>dm_change_appear 8<cþþþ> . There are too many appearance numbers to list, but experimentation will yeild results, as with the dm console command. Numbers range up to around 3200 or so if CEP2 is installed, fewer otherwise.\n<c þ >dm_change_appear base <cþþþ>= Resets the appearance of the target PC to what it was before any <c´þd>dm_change_appear<cþþþ> commands were used on them. It is only available if you are using the NWNX database, or are using the Bioware database with languages enabled. Unlike the <c´þd>dm_change_appear<cþþþ> command, this command can only be used on PCs.\n<c þ >dm_create (resref) <cþþþ>= Creates an item of the entered resref on the target.\n<c þ >dm_freeze <cþþþ>= Makes the target uncommandable. May not be targeted at a DM.\n<c þ >dm_unfreeze <cþþþ>= Makes the target commandable again.\n<c þ >dm_kill <cþþþ>= The target is killed. May not be used on DMs.\n<c þ >dm_rez <cþþþ>= The target is resurrected. May not be used on other DMs.\n<czzþ>dm_reset_mod <cþþþ>= The server is shut down and restarted immediately.\n<c þ >dm_sql <cþþþ>= Executes the input sql command to the database. It can return SELECT queries as well, so long as they specify column names instead of using *. Command format is <c×{þ>dm_sql (sql query)<cþþþ>. Only administrators can use this command.\n<c þ >dm_rest <cþþþ>= The target is instantly rested. May not be used on other DMs.\n<c þ >dm_reveal <cþþþ>= The target has their area map revealed to them.\n<c þ >dm_hide <cþþþ>= The target has their area map hidden from them.\n<czzþ>/v <cþþþ>= This is the ventriloquism command. Once they select a target, the dm may 'throw' their voice to the target at any time, simply by typing /v with a space after it, before the text to be spoken by the target. May only be used by DMs. May not be targeted at other DMs.\n<c þ >dm_jump <cþþþ>= Jumps the DM to the targeted location.\n<c þ >dm_porthere <cþþþ>= The target is teleported to the sender. May not be used on other DMs.\n<c þ >dm_porthell <cþþþ>= The target is sent for punishment. May not be used on other DMs.\n<c þ >dm_portjail <cþþþ>= The target is sent for detainment. May not be used on other DMs.\n<c þ >dm_portleader <cþþþ>= The target is teleported to his partyleader. May not be used on other DMs.\n<c þ >dm_portthere <cþþþ>= The sender is teleported to the target.\n<c þ >dm_porttown <cþþþ>= The target is teleported to town. May not be used on other DMs.\n<c þ >dm_portway <cþþþ>= The target is teleported to the specified waypoint. May not be used on other DMs.\n<c þ >dm_portpartyhere <cþþþ>= All players in the party of the target are teleported to the sender. May not be targeted at other DMs.\n<c þ >dm_portpartyhell <cþþþ>= All players in the party of the target are sent for punishment. May not be targeted at other DMs.\n<c þ >dm_portpartyjail <cþþþ>= All players in the party of the target are sent for detainment. May not be targeted at other DMs.\n<c þ >dm_portpartyleader <cþþþ>= All players in the party of the target are teleported to their partyleader. May not be targeted at other DMs.\n<c þ >dm_portpartythere <cþþþ>= All players in the party of the dm are teleported to the target of the tell. May be targeted at NPCs and other objects, unlike the other party port commands.\n<c þ >dm_portpartytown <cþþþ>= All players in the party of the target are teleported to town. May not be targeted at other DMs.\n<c þ >dm_portpartyway <cþþþ>= All players in the party of the target are teleported to the specified waypoint. May not be used on other DMs.\n<c þ >dm_setcha <cþþþ>= The target's charisma is set to the number specified. The number must be between 3 and 99 inclusive. The command format is <c´þd>dm_setcha (desired score)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setcon <cþþþ>= The target's constitution is set to the number specified. The number must be between 3 and 99 inclusive. The command format is <c´þd>dm_setcon (desired score)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setdex <cþþþ>= The target's dexterity is set to the number specified. The number must be between 3 and 99 inclusive. The command format is <c´þd>dm_setcha (desired score)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setint <cþþþ>= The target's intelligence is set to the number specified. The number must be between 3 and 99 inclusive. The command format is <c´þd>dm_setint (desired score)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setstr <cþþþ>= The target's strength is set to the number specified. The number must be between 3 and 99 inclusive. The command format is <c´þd>dm_setstr (desired score)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setwis <cþþþ>= The target's wisdom is set to the number specified. The number must be between 3 and 99 inclusive. The command format is <c´þd>dm_setwis (desired score)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setfort <cþþþ>= The target's fort save is set to the number specified. The command format is <c´þd>dm_setfort (desired save)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setreflex <cþþþ>= The target's reflex save is set to the number specified. The command format is <c´þd>dm_setreflex (desired save)<cþþþ>. May not be used on other DMs.\n<c þ >dm_setwill <cþþþ>= The target's will save is set to the number specified. The command format is <c´þd>dm_setwill (desired save)<cþþþ>. May not be used on other DMs.\n<czzþ>dm_settime <cþþþ>= This command sets the module time forward to the specified hour. The command format is <c×{þ>dm_settime (desired hour)<cþþþ>.\n<c þ >dm_setvarint <cþþþ>= Sets a local int on the target. Command format is <c´þd>dm_setvarint (name of variable) (int value)<cþþþ>. You may target the area by clicking on the ground.\n<c þ >dm_setvarfloat <cþþþ>= Sets a local float on the target. Command format is <c´þd>dm_setvarfloat (name of variable) (float value)<cþþþ>. You may target the area by clicking on the ground.\n<c þ >dm_setvarstring <cþþþ>= Sets a local string on the target. Command format is <c´þd>dm_setvarstring (name of variable) (string value)<cþþþ>. You may target the area by clicking on the ground.\n<czzþ>dm_setvarmodint <cþþþ>= Sets a local int on the module. Command format is <c×{þ>dm_setvarmodint (name of variable) (int value)<cþþþ>.\n<czzþ>dm_setvarmodfloat <cþþþ>= Sets a local float on the module. Command format is <c×{þ>dm_setvarmodfloat (name of variable) (float value)<cþþþ>.\n<czzþ>dm_setvarmodstring <cþþþ>= Sets a local string on the module. Command format is <c×{þ>dm_setvarmodstring (name of variable) (string value)<cþþþ>.\n<c þ >dm_getvarint <cþþþ>= Gets a local int on the target. Command format is <c´þd>dm_getvarint (name of variable)<cþþþ>. You may target the area by clicking on the ground.\n<c þ >dm_getvarfloat <cþþþ>= Gets a local float on the target. Command format is <c´þd>dm_getvarfloat (name of variable)<cþþþ>. You may target the area by clicking on the ground.\n<c þ >dm_getvarstring <cþþþ>= Gets a local string on the target. Command format is <c´þd>dm_getvarstring (name of variable)<cþþþ>. You may target the area by clicking on the ground.\n<czzþ>dm_getvarmodint <cþþþ>= Gets a local int on the module. Command format is <c×{þ>dm_getvarmodint (name of variable)<cþþþ>.\n<czzþ>dm_getvarmodfloat <cþþþ>= Gets a local float on the module. Command format is <c×{þ>dm_getvarmodfloat (name of variable)<cþþþ>.\n<czzþ>dm_getvarmodstring <cþþþ>= Gets a local string on the module. Command format is <c×{þ>dm_getvarmodstring (name of variable)<cþþþ>.\n<c þ >dm_setweather_a_clear <cþþþ>= The weather in the target's area is set to clear, if it is an exterior area.\n<c þ >dm_setweather_a_rain <cþþþ>= The weather in the target's area is set to rain, if it is an exterior area.\n<c þ >dm_setweather_a_reset <cþþþ>= The weather in the target's area is set back to the area default settings, if it is an exterior area.\n<c þ >dm_setweather_a_snow <cþþþ>= The weather in the target's area is set to snow, if it is an exterior area.\n<czzþ>dm_setweather_m_clear <cþþþ>= The weather is set to clear in all exterior areas.\n<czzþ>dm_setweather_m_rain <cþþþ>= The weather is set to rain in all exterior areas.\n<czzþ>dm_setweather_m_reset <cþþþ>= The weather is set back to the area default settings in all exterior areas.\n<czzþ>dm_setweather_m_snow <cþþþ>= The weather is set to snow in all exterior areas.\n<c þ >dm_spawn <cþþþ>= Spawns a creature of the specified resref at the target location. Command format is <c×{þ>dm_spawn (resref)<cþþþ>.\n<c þ >dm_stealth <cþþþ>= Toggles dm stealth mode off and on. When dm stealth mode is on tells sent to you will display the 'Player not found.' message to the sender.\n<c þ >dm_vent <cþþþ>= Can be used instead of the DM Voice Thrower to select a target for the <c×{þ>/v<cþþþ> (ventriloquism) command. May not target DMs."
    }
  },
  "Description": {
    "type": "cexolocstring",
    "value": {
      "0": ""
    }
  },
  "Identified": {
    "type": "byte",
    "value": 1
  },
  "LocalizedName": {
    "id": 62545,
    "type": "cexolocstring",
    "value": {
      "0": "DM Commands"
    }
  },
  "ModelPart1": {
    "type": "byte",
    "value": 15
  },
  "PaletteID": {
    "type": "byte",
    "value": 60
  },
  "Plot": {
    "type": "byte",
    "value": 1
  },
  "PropertiesList": {
    "type": "list",
    "value": []
  },
  "StackSize": {
    "type": "word",
    "value": 1
  },
  "Stolen": {
    "type": "byte",
    "value": 0
  },
  "Tag": {
    "type": "cexostring",
    "value": "dmcommands"
  },
  "TemplateResRef": {
    "type": "resref",
    "value": "dmcommands"
  }
}
